homework/hw1/300mm/entrance/poiseuille_flow_axissymetric_distribution_0.4/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
      type	zeroGradient;
    }
    outlet
    {
      type	fixedValue;
      value	uniform 0;
    }
    walls
    {
      type	zeroGradient;
    }
    front
    {
      type	wedge;
    }
    back
    {
      type	wedge;
    }
}

// ************************************************************************* //
